{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "89722fef-e21a-4277-8d59-7f7c0965f6a8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "connected\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import json\n",
    "from pathlib import Path\n",
    "from tqdm.auto import tqdm\n",
    "\n",
    "PROJECT_ROOT  = Path.home() / \"xai-knowledge-graph\"\n",
    "PROCESSED_DIR = PROJECT_ROOT / \"data\" / \"processed\"\n",
    "\n",
    "def load_creds(path=str(Path.home() / \"aura_cred.txt\")):\n",
    "    creds = {}\n",
    "    with open(path) as f:\n",
    "        for line in f:\n",
    "            line = line.strip()\n",
    "            if \"=\" in line and not line.startswith(\"#\"):\n",
    "                k, v = line.split(\"=\", 1)\n",
    "                creds[k.strip()] = v.strip()\n",
    "    return creds\n",
    "\n",
    "creds  = load_creds()\n",
    "driver = GraphDatabase.driver(\n",
    "    creds[\"NEO4J_URI\"],\n",
    "    auth=(creds[\"NEO4J_USERNAME\"], creds[\"NEO4J_PASSWORD\"])\n",
    ")\n",
    "DB = creds[\"NEO4J_DATABASE\"]\n",
    "\n",
    "with driver.session(database=DB) as s:\n",
    "    print(s.run(\"RETURN 'connected' AS status\").single()[\"status\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "e43485a6-faba-4066-b8a4-9b610363fe07",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Top 10 Most-Cited XAI Papers ===\n",
      "[ 26975] (2016) Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "[  5264] (2017) Explanation in Artificial Intelligence: Insights from the Social Sciences\n",
      "[  3132] (2017) Grad-CAM++: Improved Visual Explanations for Deep Convolutional Networks\n",
      "[  1817] (2018) Consistent Individualized Feature Attribution for Tree Ensembles\n",
      "[  1089] (2019) Fooling LIME and SHAP: Adversarial Attacks on Post hoc Explanation Methods\n",
      "[  1012] (2021) Explainable artificial intelligence (XAI) in deep learning-based medical image a\n",
      "[   936] (2020) Questioning the AI: Informing Design Practices for Explainable AI User Experienc\n",
      "[   908] (2018) Visual Interpretability for Deep Learning: a Survey\n",
      "[   749] (2020) Opportunities and Challenges in Explainable Artificial Intelligence (XAI): A Sur\n",
      "[   671] (2022) From Anecdotal Evidence to Quantitative Evaluation Methods: A Systematic Review \n"
     ]
    }
   ],
   "source": [
    "query =\"\"\"\n",
    "MATCH(p:Paper)\n",
    "RETURN p.title AS title,\n",
    "       p. year AS year,\n",
    "       p.citation_count AS citations\n",
    "ORDER BY citations DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"=== Top 10 Most-Cited XAI Papers ===\")\n",
    "with driver.session(database=DB)as s:\n",
    "    for row in s.run(query):\n",
    "        print(f\"[{row['citations']:>6}] ({row['year']}) {row['title'][:80]}\")\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "84afda9e-fc5e-4a58-ac5c-9cb6caef96c3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Top 10 most prolific authors in our corpus===\n",
      "Author                        Count\n",
      "S. Lapuschkin                  23\n",
      "W. Samek                       17\n",
      "Barbara Hammer                 16\n",
      "David Martens                  14\n",
      "Xuanxiang Huang                12\n",
      "João Marques-Silva             12\n",
      "P. Biecek                      12\n",
      "Francesca Toni                 11\n",
      "Wojciech Samek                 11\n",
      "Inga Strümke                   11\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (a: Author)-[:AUTHORED]->(p:Paper)\n",
    "RETURN \n",
    "    a.name AS author,\n",
    "    count(p) AS paper_count\n",
    "ORDER BY paper_count DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"=== Top 10 most prolific authors in our corpus===\")\n",
    "print(f\"{'Author':<22}{'Count':>13}\")\n",
    "with driver.session(database=DB) as s:\n",
    "    for row in s.run(query):\n",
    "        print(f\"{row['author']:<22} {row['paper_count']:>10}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0b9fb367-70d6-46dc-afb9-2fb73f1db3e7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Topic distribution ===\n",
      "Topic                       Count\n",
      "Explainability               2240\n",
      "Interpretability             1817\n",
      "SHAP                         1057\n",
      "Healthcare                    903\n",
      "Transparency                  582\n",
      "NLP                           483\n",
      "Feature Attribution           476\n",
      "Computer Vision               442\n",
      "Counterfactual                405\n",
      "Grad-CAM                      395\n",
      "LIME                          364\n",
      "Saliency                      330\n",
      "Post-hoc                      298\n",
      "Trust                         272\n",
      "Model-Agnostic                232\n",
      "Integrated Gradients          167\n",
      "Attention                     153\n",
      "Time Series                   151\n",
      "Fairness                      121\n",
      "Tabular                       116\n",
      "Graph Neural Networks          89\n",
      "Reinforcement                  88\n",
      "Causal                         55\n",
      "Federated                      42\n",
      "Adversarial                    35\n",
      "Prototype                      23\n",
      "Concept Activation             22\n",
      "Rule-based                     20\n",
      "Bias                           15\n",
      "Influence Function              3\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (p:Paper)-[:ABOUT]->(t:Topic)\n",
    "RETURN\n",
    "     t.name AS Topic,\n",
    "     count(p) AS paper_count\n",
    "ORDER BY paper_count DESC\n",
    "\"\"\"\n",
    "print(\"=== Topic distribution ===\")\n",
    "print(f\"{'Topic':<22}{'Count':>11}\")\n",
    "with driver.session(database=DB) as s:\n",
    "    for row in s.run(query):\n",
    "        print(f\"{row['Topic']:<22} {row['paper_count']:>10}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "af5dc198-5d87-43d3-95de-6bead91627b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Top 10 co-authorship pairs ===\n",
      "Author_1                  Author_2                  Count\n",
      "S. Lapuschkin             W. Samek                     11\n",
      "S. Lapuschkin             Wojciech Samek                9\n",
      "Fabian Fumagalli          Maximilian Muschalik          9\n",
      "João Marques-Silva        Xuanxiang Huang               9\n",
      "Benedict Clark            Rick Wilming                  8\n",
      "E. Pishgar                M. Pishgar                    8\n",
      "K. Alaei                  M. Pishgar                    8\n",
      "Grzegorz J. Nalepa        Szymon Bobek                  8\n",
      "Antonio Rago              Francesca Toni                8\n",
      "E. Pishgar                K. Alaei                      8\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH(a1:Author)-[:AUTHORED]->(p:Paper)<-[:AUTHORED]-(a2:Author)\n",
    "WHERE a1.name <a2.name\n",
    "RETURN\n",
    "      a1.name AS Author_1,\n",
    "      a2.name AS Author_2,\n",
    "      count (DISTINCT p) AS Collaboration\n",
    "ORDER BY Collaboration DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"=== Top 10 co-authorship pairs ===\")\n",
    "print(f\"{'Author_1':<25} {'Author_2':<25} {'Count':>5}\")\n",
    "with driver.session(database=DB) as s:\n",
    "    for row in s.run(query):\n",
    "        print(f\"{row['Author_1']:<25} {row['Author_2']:<25} {row['Collaboration']:>5}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "9e15593f-c62a-4778-9d6a-e0d8c06ce41e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Most influential papers within our corpus  ===\n",
      "[   387] (2016) Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "[   168] (2017) Explanation in Artificial Intelligence: Insights from the Social Sciences\n",
      "[    85] (2017) Grad-CAM++: Improved Visual Explanations for Deep Convolutional Networks\n",
      "[    65] (2019) Fooling LIME and SHAP: Adversarial Attacks on Post hoc Explanation Methods\n",
      "[    43] (2022) From Anecdotal Evidence to Quantitative Evaluation Methods: A Systematic Review \n",
      "[    43] (2020) Opportunities and Challenges in Explainable Artificial Intelligence (XAI): A Sur\n",
      "[    42] (2018) Consistent Individualized Feature Attribution for Tree Ensembles\n",
      "[    26] (2020) Questioning the AI: Informing Design Practices for Explainable AI User Experienc\n",
      "[    23] (2022) From Attribution Maps to Human-Understandable Explanations through Concept Relev\n",
      "[    22] (2020) Evaluating Explainable AI: Which Algorithmic Explanations Help Users Predict Mod\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH(p:Paper)<-[c:CITES]-(:Paper)\n",
    "RETURN\n",
    "    p.title AS title,\n",
    "    p.year AS year,\n",
    "    count(c) AS in_corpus_citations\n",
    "ORDER BY in_corpus_citations DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"=== Most influential papers within our corpus  ===\")\n",
    "with driver.session(database=DB)as s: \n",
    "    for row in s.run(query):\n",
    "        print(f\"[{row['in_corpus_citations']:>6}] ({row['year']}) {row['title'][:80]}\")\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "d5cf2934-e1ba-43d5-a20d-48b7bcc0a03a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Bridge papers — papers that connect Interpretability and Computer Vision  ===\n",
      "Title                                                                              Year  Citations\n",
      "----------------------------------------------------------------------------------------------------\n",
      "Grad-CAM++: Improved Visual Explanations for Deep Convolutional Networks           2017      3,132\n",
      "Visual Interpretability for Deep Learning: a Survey                                2018        908\n",
      "Towards Interpretable Semantic Segmentation via Gradient-weighted Class Activati   2020        196\n",
      "Explainable Deep Learning Methods in Medical Image Classification: A Survey        2022        139\n",
      "Explainable Artificial Intelligence for Human Decision-Support System in Medical   2021        136\n",
      "Improving Deep Learning Interpretability by Saliency Guided Training               2021        115\n",
      "Fault Diagnosis using eXplainable AI: a Transfer Learning-based Approach for Rot   2022         86\n",
      "Is Grad-CAM Explainable in Medical Images?                                         2023         78\n",
      "Deep neural network or dermatologist?                                              2019         77\n",
      "Evaluation of Interpretability for Deep Learning algorithms in EEG Emotion Recog   2021         62\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH(p:Paper)-[:ABOUT]->(:Topic {name: \"Interpretability\"})\n",
    "MATCH(p:Paper)-[:ABOUT]->(:Topic {name: \"Computer Vision\"})\n",
    "RETURN\n",
    "    p.title AS title,\n",
    "    p.year AS year,\n",
    "    p.citation_count AS citation_count\n",
    "ORDER BY citation_count DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"=== Bridge papers — papers that connect Interpretability and Computer Vision  ===\")\n",
    "print(f\"{'Title':<80} {'Year':>6} {'Citations':>10}\")\n",
    "print(\"-\" * 100)\n",
    "with driver.session(database=DB)as s:\n",
    "    for row in s.run(query):\n",
    "        print(f\"{row['title'][:80]:<80} {row['year']:>6} {row['citation_count']:>10,}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "fb63f570-38f4-4012-b745-218efc9bd5d9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Top 15 Topic co-occurrence ===\n",
      "Topic1                    Topic2                    Count\n",
      "Explainability            Interpretability            909\n",
      "Explainability            SHAP                        558\n",
      "Explainability            Healthcare                  526\n",
      "Healthcare                Interpretability            524\n",
      "Interpretability          SHAP                        507\n",
      "Explainability            Transparency                472\n",
      "Interpretability          Transparency                337\n",
      "Healthcare                SHAP                        252\n",
      "Explainability            Feature Attribution         251\n",
      "Computer Vision           Explainability              248\n",
      "Explainability            LIME                        240\n",
      "Interpretability          NLP                         238\n",
      "Explainability            NLP                         237\n",
      "Computer Vision           Interpretability            230\n",
      "Explainability            Trust                       223\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (p:Paper)-[:ABOUT]->(t1:Topic),\n",
    "      (p)-[:ABOUT]->(t2:Topic)\n",
    "WHERE (t1.name)<(t2.name)\n",
    "RETURN\n",
    "    t1.name AS Topic1,\n",
    "    t2.name AS Topic2,\n",
    "    count(distinct p) AS Count\n",
    "ORDER BY Count DESC\n",
    "LIMIT 15\n",
    "\"\"\"\n",
    "print(\"=== Top 15 Topic co-occurrence ===\")\n",
    "print(f\"{'Topic1':<25} {'Topic2':<25} {'Count':>5}\")\n",
    "with driver.session(database=DB) as s:\n",
    "    for row in s.run(query):\n",
    "        print(f\"{row['Topic1']:<25} {row['Topic2']:<25} {row['Count']:>5}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "46bfc0c8-6926-4626-a701-1118c3466920",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Top 10 authors most cited within a specific topic area ===\n",
      "Author                          In-Corpus Cites   SHAP Papers\n",
      "--------------------------------------------------------------\n",
      "Emily Jia                                    65             1\n",
      "Sophie Hilgard                               65             1\n",
      "Himabindu Lakkaraju                          65             1\n",
      "Dylan Slack                                  65             1\n",
      "Sameer Singh                                 65             1\n",
      "Su-In Lee                                    43             2\n",
      "Scott M. Lundberg                            43             2\n",
      "Gabriel Erion-Barner                         42             1\n",
      "Barbara Hammer                               24             4\n",
      "Maximilian Muschalik                         24             4\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (a:Author)-[:AUTHORED]->(p:Paper)-[:ABOUT]->(:Topic {name: \"SHAP\"}),\n",
    "      (p)<-[c:CITES]-(:Paper)\n",
    "RETURN\n",
    "    a.name AS Author,\n",
    "    count(DISTINCT p) AS shap_papers,\n",
    "    count(DISTINCT c) AS in_corpus_citations\n",
    "ORDER BY in_corpus_citations DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"=== Top 10 authors most cited within a specific topic area ===\")\n",
    "print(f\"{'Author':<30} {'In-Corpus Cites':>16} {'SHAP Papers':>13}\")\n",
    "print(\"-\" * 62)\n",
    "with driver.session(database=DB) as s:\n",
    "    for row in s.run(query):\n",
    "        print(f\"{row['Author']:<30} {row['in_corpus_citations']:>16} {row['shap_papers']:>13}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "0fa138ca-1cd9-4bc7-93f1-607161eb38a8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Most influential paper per topic, last 3 years  ===\n",
      "Topic                     Title                                                          Year  Citations\n",
      "----------------------------------------------------------------------------------------------------\n",
      "Adversarial               Distance-Restricted Explanations: Theoretical Underpinnings    2024         22\n",
      "Attention                 ConceptAttention: Diffusion Transformers Learn Highly Interp   2025         42\n",
      "Bias                      Visual-TCAV: Concept-based Attribution and Saliency Maps for   2024         11\n",
      "Causal                    The role of causality in explainable artificial intelligence   2023         49\n",
      "Computer Vision           Is Grad-CAM Explainable in Medical Images?                     2023         78\n",
      "Concept Activation        Visual-TCAV: Concept-based Attribution and Saliency Maps for   2024         11\n",
      "Counterfactual            The role of causality in explainable artificial intelligence   2023         49\n",
      "Explainability            A Perspective on Explainable Artificial Intelligence Methods   2023        620\n",
      "Fairness                  Explainable Artificial Intelligence: A Survey of Needs, Tech   2024        155\n",
      "Feature Attribution       Can Large Language Models Explain Themselves? A Study of LLM   2023        127\n",
      "Federated                 A Comprehensive Review of Techniques, Algorithms, Advancemen   2025         46\n",
      "Grad-CAM                  Is Grad-CAM Explainable in Medical Images?                     2023         78\n",
      "Graph Neural Networks     Heterogeneous Graph Neural Networks with Post-hoc Explanatio   2024         14\n",
      "Healthcare                A Perspective on Explainable Artificial Intelligence Methods   2023        620\n",
      "Influence Function        Leveraging Influence Functions for Resampling Data in Physic   2025          1\n",
      "Integrated Gradients      Finding the right XAI method -- A Guide for the Evaluation a   2023         67\n",
      "Interpretability          A Perspective on Explainable Artificial Intelligence Methods   2023        620\n",
      "LIME                      A Perspective on Explainable Artificial Intelligence Methods   2023        620\n",
      "Model-Agnostic            A Perspective on Explainable Artificial Intelligence Methods   2023        620\n",
      "NLP                       Can Large Language Models Explain Themselves? A Study of LLM   2023        127\n",
      "Post-hoc                  Distribution-Based Feature Attribution for Explaining the Pr   2025         61\n",
      "Prototype                 Self-eXplainable AI for Medical Image Analysis: A Survey and   2024         40\n",
      "Reinforcement             Seg-Zero: Reasoning-Chain Guided Segmentation via Cognitive    2025        190\n",
      "Rule-based                Shapley-based Explainable AI for Clustering Applications in    2023         43\n",
      "SHAP                      A Perspective on Explainable Artificial Intelligence Methods   2023        620\n",
      "Saliency                  A Mutual Learning Method for Salient Object Detection with i   2025        238\n",
      "Tabular                   A Perspective on Explainable Artificial Intelligence Methods   2023        620\n",
      "Time Series               A Survey of Explainable Artificial Intelligence (XAI) in Fin   2024         56\n",
      "Transparency              Explainable Artificial Intelligence: A Survey of Needs, Tech   2024        155\n",
      "Trust                     A Review on Explainable Artificial Intelligence for Healthca   2023        136\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (p:Paper)-[:ABOUT]->(t:Topic)\n",
    "\n",
    "WHERE p.year >= 2023\n",
    "WITH t,p\n",
    "ORDER BY t.name, p.citation_count DESC\n",
    "WITH t, collect(p)[0] AS top_paper\n",
    "\n",
    "RETURN\n",
    "    t.name AS Topic,\n",
    "    top_paper.title AS Title,\n",
    "    top_paper.year AS Year,\n",
    "    top_paper.citation_count AS citation_count\n",
    "    \n",
    "ORDER BY Topic\n",
    "\"\"\"\n",
    "print(\"=== Most influential paper per topic, last 3 years  ===\")\n",
    "print(f\"{'Topic':<25} {'Title':<60} {'Year':>6} {'Citations':>10}\")\n",
    "print(\"-\" * 100)\n",
    "with driver.session(database=DB)as s:\n",
    "    for row in s.run(query):\n",
    "        print(f\"{row['Topic'][:80]:<25} {row['Title'][:60]:<60} {row['Year']:>6} {row['citation_count']:>10,}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "644af3c2-228d-4d61-8955-508c4cd62a07",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Top 10 Papers Most Similar to Grad-CAM (by shared topics) ===\n",
      "Source                         Similar Paper                                        Shared  Topics\n",
      "----------------------------------------------------------------------------------------------------\n",
      "Enhanced SegNet with Integrate From Explanations to Architecture: Expla               6  Transparency, Explainability, Trust, Interpretability, Grad-CAM, Healthcare\n",
      "Enhanced SegNet with Integrate Brain Stroke Detection and Classificatio               6  Transparency, Explainability, Trust, Interpretability, Grad-CAM, Healthcare\n",
      "Enhanced SegNet with Integrate Choose Your Explanation: A Comparison of               6  Transparency, Explainability, Trust, Interpretability, Grad-CAM, Healthcare\n",
      "Seeing Isn't Always Believing: Dual-Modal Lung Cancer AI: Interpretable               6  Computer Vision, Explainability, Interpretability, Grad-CAM, Healthcare, Saliency\n",
      "Enhanced SegNet with Integrate Explainable AI: A Combined XAI Framework               6  Transparency, Explainability, Trust, Interpretability, Grad-CAM, Healthcare\n",
      "Enhanced SegNet with Integrate Smart Diagnosis and Early Intervention i               5  Transparency, Explainability, Interpretability, Grad-CAM, Healthcare\n",
      "Enhanced SegNet with Integrate Explainable Deep Learning for Pediatric                5  Transparency, Explainability, Interpretability, Grad-CAM, Healthcare\n",
      "Enhanced SegNet with Integrate FairMed-XGB: A Bayesian-Optimised Multi-               5  Transparency, Explainability, Trust, Interpretability, Healthcare\n",
      "Enhanced SegNet with Integrate ECG-IMN: Interpretable Mesomorphic Neura               5  Transparency, Explainability, Interpretability, Grad-CAM, Healthcare\n",
      "Enhanced SegNet with Integrate NEURON: A Neuro-symbolic System for Grou               5  Transparency, Explainability, Trust, Interpretability, Healthcare\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (source:Paper)\n",
    "WHERE source.title CONTAINS \"Grad-CAM\"\n",
    "MATCH (source)-[:ABOUT]->(t:Topic)<-[:ABOUT]-(other:Paper)\n",
    "WHERE other <> source\n",
    "\n",
    "WITH\n",
    "    source,\n",
    "    other,\n",
    "    Collect(t.name) AS Shared_topic,\n",
    "    Count(DISTINCT t) AS Shared_topic_count\n",
    "RETURN\n",
    "    source.title AS Source_Paper,\n",
    "    other.title As Similar_paper,\n",
    "    Shared_topic,\n",
    "    Shared_topic_count\n",
    "ORDER BY Shared_topic_count DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"=== Top 10 Papers Most Similar to Grad-CAM (by shared topics) ===\")\n",
    "print(f\"{'Source':<30} {'Similar Paper':<50} {'Shared':>8}  Topics\")\n",
    "print(\"-\" * 100)\n",
    "with driver.session(database=DB) as s:\n",
    "    for row in s.run(query):\n",
    "        topics_str = \", \".join(row['Shared_topic'])\n",
    "        print(f\"{row['Source_Paper'][:30]:<30} {row['Similar_paper'][:40]:<50} {row['Shared_topic_count']:>5}  {topics_str}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "538b6ab3-934f-41ac-8549-bd8eea83e77b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== Shortest Citation Paths from 2025+ Papers to Grad-CAM ===\n",
      "\n",
      "[1 hops]\n",
      "   A Two-Stage LLM Framework for Accessible and Verified XAI Explanations\n",
      "   → Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "\n",
      "[1 hops]\n",
      "   Med-CAM: Minimal Evidence for Explaining Medical Decision Making\n",
      "   → Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "\n",
      "[1 hops]\n",
      "   Explainable Fall Detection for Elderly Monitoring via Temporally Stable SHAP in \n",
      "   → Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "\n",
      "[1 hops]\n",
      "   On the Importance and Evaluation of Narrativity in Natural Language AI Explanati\n",
      "   → Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "\n",
      "[1 hops]\n",
      "   Attention-ResUNet for Automated Fetal Head Segmentation\n",
      "   → Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "\n",
      "[1 hops]\n",
      "   Multimodal Fusion of Histopathology Images and Electronic Health Records for Ear\n",
      "   → Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "\n",
      "[1 hops]\n",
      "   Automated Palynological Analysis System: Integrating Deep Metric Learning and $U\n",
      "   → Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "\n",
      "[1 hops]\n",
      "   How Can One Choose the Best CAM-Based Explainability Method for a CNN Model?\n",
      "   → Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "\n",
      "[1 hops]\n",
      "   Dual-Modal Lung Cancer AI: Interpretable Radiology and Microscopy with Clinical \n",
      "   → Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "\n",
      "[1 hops]\n",
      "   CBAM-Enhanced DenseNet121 for Multi-Class Chest X-Ray Classification with Grad-C\n",
      "   → Grad-CAM: Visual Explanations from Deep Networks via Gradient-based Localization\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH path= shortestPath((source:Paper)-[:CITES*]->(target:Paper))\n",
    "WHERE source.year>=2025 \n",
    "    AND target.arxiv_id = \"1610.02391\"\n",
    "RETURN\n",
    "    [n IN nodes(path) | n.title] AS titles, \n",
    "    length(path) AS hops\n",
    "ORDER BY hops ASC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"=== Shortest Citation Paths from 2025+ Papers to Grad-CAM ===\")\n",
    "print()\n",
    "with driver.session(database=DB) as s:\n",
    "    for row in s.run(query):\n",
    "        chain = \"\\n   → \".join(t[:80] for t in row['titles'])\n",
    "        print(f\"[{row['hops']} hops]\\n   {chain}\")\n",
    "        print()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2064e39c-b496-4d92-a9b4-8126001e3f55",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [conda env:base] *",
   "language": "python",
   "name": "conda-base-py"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.15"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
